Autodesk.Revit.DB.WorksetConfiguration.Close(System.Collections.Generic.IList{Autodesk.Revit.DB.WorksetId})
Sets a group of user-created worksets to close.
Remarks:
Calling this method on a configuration created with options other than WorksetConfigurationOption.CloseAllWorksets will set these
worksets to be explicitly closed.  If all worksets are set to close, the configuration will be unchanged.  Worksets other than the inputs are unaffected.
worksetsToClose:
The group of user-created worksets to close.  Non-user-created worksets and invalid workset ids will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.Open(System.Collections.Generic.IList{Autodesk.Revit.DB.WorksetId})
Sets a group of user-created worksets to open.
Remarks:
Calling this method on a configuration created with options other than WorksetConfigurationOption.OpenAllWorksets will set these
worksets to be explicitly opened.  If all worksets are set to open, the configuration will be unchanged.  Worksets other than the inputs are unaffected.
worksetsToOpen:
The group of user-created worksets to open.  Non-user-created worksets and invalid workset ids will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.OpenEditable
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.IsUserSpecify
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.#ctor(Autodesk.Revit.DB.WorksetConfigurationOption)
Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
option:
The option to open or close all user created worksets by default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.WorksetConfiguration.#ctor
Constructs a new workset configuration with an initial setting to open all user-created worksets.
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.#ctor(Autodesk.Revit.DB.WorksetConfiguration)
Constructs a new copy of the input WorksetConfiguration object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration
A configuration class that is passed in to methods that open Revit documents to specify which user-created worksets are opened/closed.
Remarks:
Once an instance of this class is created, it can be further modified
by calling any of the other methods in any order. It is a specification of a setting for model open;
the methods of this class just adjust the specification, and do not themselves open or close worksets.
Only user-created worksets can be specified to be opened or closed.  All system worksets are automatically open.
An open workset allows its elements can be expanded and displayed.
For a closed workset, Revit tries to not expand its elements, and to that end, does not display them.
This is intended to help with performance by reducing Revit's memory footprint.
Since:
2014